{
  "type": "https://eips.ethereum.org/EIPS/eip-8004#registration-v1",
  "name": "AvaBuilder Agent",
  "description": "AvaBuilder is an autonomous AI agent purpose-built for the Avalanche ecosystem. It delivers real-time DeFi analytics (TVL, 50+ protocols, trading pairs) via DeFiLlama, CoinGecko, and DEX Screener APIs; full visibility into 500+ active L1 blockchains via Glacier API; 8 step-by-step build templates (L1, ERC-20, DEX, cross-chain bridge, gaming chain, RWA tokenization, x402 agent); 3 structured learning paths; and an AI-powered builder guide backed by Claude and 128K+ lines of official Avalanche documentation. The agent supports three interoperability protocols: A2A (agent-to-agent natural language Q&A via POST /a2a/guide), MCP (Model Context Protocol server at POST /mcp exposing 10 callable tools with full JSON schemas for programmatic access by other AI agents), and x402 (micropayment-gated endpoints via USDC on Avalanche). NLP capability: the agent receives natural language questions, retrieves relevant documentation, and synthesizes technical answers in seconds. API schema understanding: other agents can discover all 10 MCP tools via tools/list, inspect their input schemas, and invoke them via tools/call without human intervention. Workflow automation: the agent exposes composable tools (price, TVL, protocols, L1s, templates, learning paths, ecosystem data) that external agents can chain together into automated multi-step workflows; internally, the agent includes an x402 client capable of discovering and paying other ERC-8004 agents. 20 API endpoints total (19 free, 1 paid). Registered on-chain under ERC-8004 on Avalanche Mainnet (Agent #1686) and Fuji Testnet (Agent #15). Created by Cyber Paisa.",
  "image": "https://avariskscan-defi-production.up.railway.app/public/avabuilder-agent.png",
  "services": [
    {
      "name": "web",
      "endpoint": "https://avariskscan-defi-production.up.railway.app/"
    },
    {
      "name": "A2A",
      "endpoint": "https://avariskscan-defi-production.up.railway.app/.well-known/agent-card.json",
      "version": "0.3.0"
    },
    {
      "name": "MCP",
      "endpoint": "https://avariskscan-defi-production.up.railway.app/mcp",
      "version": "2025-06-18"
    }
  ],
  "x402Support": true,
  "active": true,
  "registrations": [
    {
      "agentId": 15,
      "agentRegistry": "eip155:43113:0x8004A818BFB912233c491871b3d84c89A494BD9e"
    },
    {
      "agentId": 1686,
      "agentRegistry": "eip155:43114:0x8004A169FB4a3325136EB29fA0ceB6D2e539a432"
    }
  ],
  "supportedTrust": ["reputation"],
  "capabilities": [
    "ecosystem-explorer",
    "defi-analytics",
    "l1-blockchain-guide",
    "smart-contract-guide",
    "defi-architecture-guide",
    "cross-chain-bridge-guide",
    "tokenomics-design",
    "sdk-guidance",
    "build-templates",
    "learning-paths",
    "agent-discovery",
    "x402-payments",
    "natural_language_processing/information_retrieval_synthesis/search",
    "tool_interaction/api_schema_understanding",
    "tool_interaction/workflow_automation"
  ]
}
